from random import shuffle

'''
Масти:
    черви, пики, бубны, крести
    
Колода:
    на каждую масть карты от 6 до туза = 36 карт

Перетасовать колоду

Игроки - от 2 до ...

Каждому игроку дать по 2 карты

Можно смотреть только свои карты

Ход: беру ещё карту (сколько угодно, не больше, чем осталось в колоде)
или закончить ход

Каждый игрок делает один ход за партию

Если сумма цен всех карт игрока больше 21, то он проиграл

Если все игроки проиграли, то это ничья

Победитель тот, кто набрал больше всего очков

Если число очков равное, то будет ничья
'''

suits = ['Пики', 'Черви', 'Крести', 'Бубны']

cards = {
    '6': 6,
    '7': 7,
    '8': 8,
    '9': 9,
    '10': 10,
    'В': 2,
    'Д': 3,
    'К': 4,
    'Т': 11
}

deck = []

for suit in suits:
    for item in cards:
        card = {
            'цена': cards[item],
            'масть': suit,
            'название': item
        }
        deck.append(card)\
        
shuffle(deck)

player_1 = {
        'имя': 'Дурик',
        'Карты': [],
        'Человек': True
    }

player_2 = {
        'имя': 'Дебик',
        'Карты': [],
        'Человек': True
    }

players = (player_1, player_2)
for player in players:
    for i in range(2):
        player['карты'].append(deck.pop())
for player in players:
    print(player[card])


'''
print('Карт в колоде', len(deck))
for carg in deck:
    print(card)
    print('-' * 20)
'''