passengers = [
    {
        "место": 0,
        "имя": "Питонов Василий Аспидович",
        "проверен": False,
        "ручная кладь": ["ноутбук", "наушники"]
    },
    {
        "место": 1,
        "имя": "Блинохватов Прохор Аскольдович",
        "проверен": False,
        "ручная кладь": ["книга", "четки", "беруши"]
    },
    {
        "место": 2,
        "имя": "Бабахин Капитон Кондратьевич",
        "проверен": False,
        "ручная кладь": ["семечки", "граната", "кепка"]
    },
    {
        "место": 3,
        "имя": "Бескровная Таисия Ипатовна",
        "проверен": False,
        "ручная кладь": ["журнал", "букет", "горсть земли"]
    },
    {
        "место": 4,
        "имя": "Аскетов Демьян Захарьевич",
        "проверен": False,
        "ручная кладь": []
    }
]

banned_items = ['нож', 'бензин', 'граната', 'пистолет']
print(f'Пассажиров на проверке: {len(passengers)}')
allowed_passenger = 0

for passenger in passengers:
    for item in passenger['ручная кладь']:
        if item in banned_items:
            print(f'В ручной клади пассажира {passenger["имя"]}')
            break

        else:
            allowed_passenger += 1
            print(f'Пассажир {passenger["имя"]} допушен к вылету')

print(f'Допущенно к вылету пассажиров: {allowed_passenger}')