questions = [
    {
        'Текст вопроса': 'Чей Крым?',
        'Варианты ответов': ['Россия', 'Украина', 'Турция', 'Третий Рейх'],
        'индекс верного ответа': 'Россия'
        'изображение': 'images_1'
    },
    {
        'Текст вопроса': 'Столица РФ?',
        'Варианты ответов': ['Киев', 'Санкт-Петербург', 'Москва', 'Мухосранск'],
        'индекс верного ответа': 'Москва'
        'изображение': 'images_2'
    },
    {
        'Текст вопроса': 'Cколько морей омывает РФ?',
        'Варианты ответов': ['0', '7', '13', '12'],
        'индекс верного ответа': '12'
        'изображение': 'images_3'
    },
    {
        'Текст вопроса': 'Самая высокая гора России?',
        'Варианты ответов': ['Эльбрус', 'Белуха', 'Ключевская сопка', 'Кудыкина гора'],
        'индекс верного ответа': 'Белуха'
        'изображение': 'images_4'
    },
    {
        'Текст вопроса': 'Самая длинная река России?',
        'Варианты ответов': ['Волга', 'Москва', 'Лена', 'Колыма'],
        'индекс верного ответа': 'Лена'
        'изображение': 'images_5'
    },
    {
        'Текст вопроса': 'Какой из этих городов самый старый?',
        'Варианты ответов': ['Москва', 'Королёв', 'Великий Новгород', 'Дербент'],
        'индекс верного ответа': 'Дербент'
    },
    {
        'Текст вопроса': 'На какой реке находится Санкт-Петербург?',
        'Варианты ответов': ['Нева', 'Москва', 'Анадырь', 'Кубань'],
        'индекс верного ответа': 'Нева'
    },
    {
        'Текст вопроса': 'Самая северная точка России?',
        'Варианты ответов': ['Арбат', 'Мыс Дежнёва', 'Мыс Челюскин', 'Крым'],
        'индекс верного ответа': 'Мыс Челюскин'
    },
    {
        'Текст вопроса': 'Какой город был столицей России?',
        'Варианты ответов': ['Ростов', 'Владимир', 'Нижний Новгород', 'Не один из перечисленных'],
        'индекс верного ответа': 'Владимир'
    },
    {
        'Текст вопроса': 'Первый правитель России?',
        'Варианты ответов': ['Рюрик', 'Пётр 1', 'Путин', 'Иван Грозный'],
        'индекс верного ответа': 'Рюрик'
    },
]
